package day4.day5;

public class Test1 {
    public static void main(String[] args) {
/*

1. 一个类与它的对象之间是什么关系？

类是对象的模板，对象是类的实体

2. 如何定义一个类，由哪些部分组成，各个部分的作用是什么？

定义一个类
    public 类名 {
        成员变量
        成员方法
    }

由类名、成员变量、成员方法组成
类名是一个类的名称，用于区分不同的类
成员变量是类的属性
成员方法是类的行为

3. 如何创建一个对象，如何使用该对象？

创建对象用new 关键字：类名 对象名 = new 类名();
使用对象访问对象的成员的方法
    对象名.成员变量
    对象名.成员方法

4. 局部变量和成员变量的区别？

在类中的位置不同
    成员变量：类中，方法外
    局部变量：方法中或者方法声明上(形式参数)
作用范围不一样
    成员变量：类中
    局部变量：方法中
初始化值的不同
    成员变量：有默认值
    局部变量：没有默认值。必须先定义，赋值，最后使用
在内存中的位置不同
    成员变量：堆内存
    局部变量：栈内存
生命周期不同
    成员变量：随着对象的创建而存在，随着对象的消失而消失
    局部变量：随着方法的调用而存在，随着方 法的调用完毕而消失

5. 构造方法和成员方法的区别？

构造方法无返回值，void 也没有，成员方法有返回值，最少也要有个void
构造方法再创建对象时调用，成员方法通过对象才能调用

6. 请简述封装原则？
将属性隐藏起来，若需要访问某个属性，提供公共方法对其访问

*/
    }
}
