package day8;

public class Test1 {
/*

1. 什么是接口，如何定义接口？

接口，是Java语言中一种引用类型，是方法的集合，
如果说类的内部封装了成员变量、构造方法和成员方法，那么 接口的内部主要就是封装了方法，
包含抽象方法（JDK 7及以前），默认方法和静态方法（JDK 8），私有方法 （JDK 9）。

public interface 接口名称 {
    // 抽象方法
    // 默认方法
    // 静态方法
    // 私有方法
}

2. 什么叫做多态，条件是什么？

    1. 继承或者实现【二选一】
    2. 方法的重写【意义体现：不重写，无意义】
    3. 父类引用指向子类对象【格式体现】

3. 使用多态特性，带来了什么样的好处？

    实际开发的过程中，父类类型作为方法形式参数，
    传递子类对象给方法，进行方法的调用，更能体现出多态的扩展性与便利。

4. 使用多态特性，注意什么样的弊端？

    当使用多态方式调用方法时，首先检查父类中是否有该方法，如果没有，则编译错误。
    也就是说，不能调用子类拥有，而父类没有的方法。

*/
}
