package day7;

public class Test1 {
/*

1. 什么叫做类与类的继承，作用是什么？

    就是子类继承父类的属性和行为，使得子类对象具有与父类相同的属性、相同的行为。
    子类可以直接访问父类中的非私有的属性和行为。
    好处：
        1. 提高代码的复用性。
        2. 类与类之间产生了关系，是多态的前提。

2. 请写出继承的格式

    class 父类 {
        ...
    }
    class 子类 extends 父类 {
        ...
    }

3. 请写出继承的特点

    1. Java只支持单继承，不支持多继承。
    2. 一个类可以有多个子类。
    3. Java支持多层继承(继承体系)。
        顶层父类是Object类。所有的类默认继承Object，作为父类。
    4. 子类和父类是一种相对的概念。

4. 请写出抽象方法的定义格式

    修饰符 abstract 返回值类型 方法名 (参数列表)；

5. 请写出抽象类的定义格式?并举例定义带有抽象方法的抽象类

    abstract class 类名字 {
    }

    public abstract class Animal {
        public abstract void run();
    }

6. 请写出抽象类的使用步骤

    1、使用实现类继承抽象类
        必须重写父类的抽象方法
    2、创建实现类对象
        抽象类不能被实例化
    3、调用抽象类的成员属性或方法

*/
}
